Loading package and connecting to database

In [4]:
%load_ext sql

%sql mysql+pymysql://root:@localhost/chocolates #connecting to db names chocolates running on local mysql server

0 rows affected.

[]

In [ ]:
%%sql
SHOW TABLES;

In [ ]:
%%sql
#JOIN ON 
SELECT
    S.SALEDATE,
    G.GEO
FROM
    SALES AS S
    JOIN GEO AS G ON S.GEOID = G.GEOID
LIMIT
    10;

In [6]:
%%sql
SELECT
    S.SALEDATE,
    G.GEO,
    PR.PRODUCT

FROM
    SALES AS S
    INNER JOIN GEO AS G ON S.GEOID = G.GEOID
    INNER JOIN PRODUCTS AS PR ON S.PID = PR.PID
WHERE PR.SIZE = "LARGE"
LIMIT 10;

 * mysql+pymysql://root:***@localhost/chocolates
10 rows affected.

[(datetime.datetime(2021, 1, 1, 0, 0), 'New Zealand', 'Raspberry Choco'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'USA', '99% Dark & Pure'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'UK', 'Raspberry Choco'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'New Zealand', 'Milk Bars'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'USA', 'Milk Bars'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'Canada', 'Mint Chip Choco'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'USA', 'Orange Choco'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'India', 'Eclairs'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'India', 'After Nines'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'UK', 'Mint Chip Choco')]

In [9]:
%%sql
#MULTIPLE TABLE JOIN
SELECT
    S.SALEDATE,
    G.GEO,
    PR.PRODUCT,
    P.SALESPERSON

FROM
    SALES AS S
    INNER JOIN GEO AS G ON S.GEOID = G.GEOID
    INNER JOIN PRODUCTS AS PR ON S.PID = PR.PID
    INNER JOIN PEOPLE AS P ON S.SPID = P.SPID
WHERE PR.SIZE = "LARGE"
LIMIT 10;

 * mysql+pymysql://root:***@localhost/chocolates
10 rows affected.

[(datetime.datetime(2021, 1, 1, 0, 0), 'New Zealand', 'Raspberry Choco', 'Barr Faughny'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'USA', '99% Dark & Pure', 'Karlen McCaffrey'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'UK', 'Raspberry Choco', 'Oby Sorrel'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'New Zealand', 'Milk Bars', 'Curtice Advani'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'USA', 'Milk Bars', 'Madelene Upcott'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'Canada', 'Mint Chip Choco', 'Jehu Rudeforth'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'USA', 'Orange Choco', 'Jehu Rudeforth'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'India', 'Eclairs', 'Brien Boise'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'India', 'After Nines', 'Curtice Advani'),
 (datetime.datetime(2021, 1, 1, 0, 0), 'UK', 'Mint Chip Choco', 'Camilla Castle')]

In [17]:
%%sql
SELECT
    COUNT(*),
    S.SALEDATE,
    G.GEO
FROM
    SALES AS S
    INNER JOIN GEO AS G ON S.GEOID = G.GEOID
;

 * mysql+pymysql://root:***@localhost/chocolates
1 rows affected.

[(7617, datetime.datetime(2021, 1, 1, 0, 0), 'New Zealand')]

In [23]:
%%sql
SELECT * FROM EMPLOYEES;

 * mysql+pymysql://root:***@localhost/chocolates
10 rows affected.

[(1, 'Alice', 101),
 (2, 'Bob', 102),
 (3, 'Carol', 103),
 (4, 'David', 101),
 (5, 'Eve', None),
 (6, 'Frank', 104),
 (7, 'Grace', 102),
 (8, 'Hank', None),
 (9, 'Ivy', 105),
 (10, 'Jack', 101)]

In [25]:
%%sql
SELECT * FROM DEPARTMENTS;

 * mysql+pymysql://root:***@localhost/chocolates
6 rows affected.

[(101, 'HR'),
 (102, 'Finance'),
 (103, 'Engineering'),
 (104, 'Marketing'),
 (105, 'Sales'),
 (106, 'IT')]

In [30]:
%%sql
SELECT
    E.EMP_NAME,
    D.DEPT_NAME
FROM
    EMPLOYEES AS E
    JOIN DEPARTMENTS AS D ON E.DEPARTMENT_ID = D.DEPT_ID;

 * mysql+pymysql://root:***@localhost/chocolates
8 rows affected.

[('Alice', 'HR'),
 ('Bob', 'Finance'),
 ('Carol', 'Engineering'),
 ('David', 'HR'),
 ('Frank', 'Marketing'),
 ('Grace', 'Finance'),
 ('Ivy', 'Sales'),
 ('Jack', 'HR')]

In [32]:
%%sql
#LEFT JOIN
SELECT
    E.EMP_NAME,
    D.DEPT_NAME
FROM
    EMPLOYEES AS E
    LEFT JOIN DEPARTMENTS AS D ON E.DEPARTMENT_ID = D.DEPT_ID;

 * mysql+pymysql://root:***@localhost/chocolates
10 rows affected.

[('Alice', 'HR'),
 ('Bob', 'Finance'),
 ('Carol', 'Engineering'),
 ('David', 'HR'),
 ('Eve', None),
 ('Frank', 'Marketing'),
 ('Grace', 'Finance'),
 ('Hank', None),
 ('Ivy', 'Sales'),
 ('Jack', 'HR')]

In [36]:
%%sql
#RIGHT JOIN
SELECT 
    E.EMP_NAME,
    D.DEPT_NAME
FROM
    EMPLOYEES AS E
    RIGHT JOIN DEPARTMENTS AS D ON E.DEPARTMENT_ID = D.DEPT_ID;

 * mysql+pymysql://root:***@localhost/chocolates
9 rows affected.

[('Alice', 'HR'),
 ('Bob', 'Finance'),
 ('Carol', 'Engineering'),
 ('David', 'HR'),
 ('Frank', 'Marketing'),
 ('Grace', 'Finance'),
 ('Ivy', 'Sales'),
 ('Jack', 'HR'),
 (None, 'IT')]

In [34]:
%%sql
#INNER JOIN
SELECT
    E.EMP_NAME,
    D.DEPT_NAME
FROM
    EMPLOYEES AS E
    INNER JOIN DEPARTMENTS AS D ON E.DEPARTMENT_ID = D.DEPT_ID;

 * mysql+pymysql://root:***@localhost/chocolates
8 rows affected.

[('Alice', 'HR'),
 ('Bob', 'Finance'),
 ('Carol', 'Engineering'),
 ('David', 'HR'),
 ('Frank', 'Marketing'),
 ('Grace', 'Finance'),
 ('Ivy', 'Sales'),
 ('Jack', 'HR')]

In [35]:
%%sql
#OUTER JOIN EMULATED USING UNION AS THE PARTICULAR DB VERSION DOES NOT SUPPORT OUTER JOIN 
SELECT
    E.EMP_NAME,
    D.DEPT_NAME
FROM
    EMPLOYEES AS E
    LEFT JOIN DEPARTMENTS AS D ON E.DEPARTMENT_ID = D.DEPT_ID
UNION
SELECT
    E.EMP_NAME,
    D.DEPT_NAME
FROM
    EMPLOYEES AS E
    RIGHT JOIN DEPARTMENTS AS D ON E.DEPARTMENT_ID = D.DEPT_ID;

 * mysql+pymysql://root:***@localhost/chocolates
11 rows affected.

[('Alice', 'HR'),
 ('Bob', 'Finance'),
 ('Carol', 'Engineering'),
 ('David', 'HR'),
 ('Eve', None),
 ('Frank', 'Marketing'),
 ('Grace', 'Finance'),
 ('Hank', None),
 ('Ivy', 'Sales'),
 ('Jack', 'HR'),
 (None, 'IT')]